Revit 2024 API
FabricationPart.HasInsulation Property
 True if the fabrication part is insulated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool HasInsulation { get; }
Visual Basic
Public ReadOnly Property HasInsulation As Boolean
	Get
Visual C++
public:
property bool HasInsulation {
	bool get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace